# ClosestPointsPairBetweenTwoCurves Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ClosestPointsPairBetweenTwoCurves Properties
ClosestPointsPairBetweenTwoCurves Class See Also
---
The ClosestPointsPairBetweenTwoCurves type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Distance | Distance from point on first curve to the point on second curve. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| ParameterOnFirstCurve | 1d raw (not normalized) parameter of the point on the first curve. |
| ParameterOnSecondCurve | 1d raw (not normalized) parameter of the point on the second curve. |
| XYZPointOnFirstCurve | Point on the first curve in 3d coordinates. |
| XYZPointOnSecondCurve | Point on the second curve in 3d coordinates. |

# See Also
ClosestPointsPairBetweenTwoCurves Class
Autodesk.Revit.DB Namespace